---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Erase(Autodesk.Revit.DB.Electrical.WireConduitType)
source: html/025800a8-f406-7a86-fa61-4be8fb137478.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Erase Method

Removes a specified conduit type from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	WireConduitType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.WireConduitType`) - The conduit type to be erased.

## Returns
The number of conduit types that were erased from the set.